tap "laishulu/homebrew"
tap "runpod/runpodctl"
tap "steipete/tap"

# Essential CLI tools
brew "bash"
brew "bat"
brew "bfg"
brew "bottom"
brew "cmake"
brew "curl"
brew "docker"
brew "docker-compose"
brew "dust"
brew "eza"
brew "fcitx-remote-for-osx"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "httpie"
brew "jq"
brew "lazygit"
brew "marksman"
brew "midnight-commander"
brew "neo4j", restart_service: :changed
brew "neovim"
brew "portaudio"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "python@3.12"
brew "ripgrep"
brew "rustup"
brew "sd"
brew "terminal-notifier"
brew "tmux"
brew "wget"
brew "yq"
brew "zoxide"

# Custom taps
brew "laishulu/homebrew/macism"
brew "runpod/runpodctl/runpodctl"

# Casks
cask "1password-cli"
cask "font-fira-code-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "swiftbar"
