# Homebrew packages for macOS
# Usage: brew bundle --file=manual/homebrew/Brewfile

# Note: homebrew/bundle and homebrew/services are now built-in

# Essential tools
brew "git"
brew "wget"
brew "curl"

# Modern CLI replacements
brew "eza"           # modern ls (replaces exa)
brew "bat"           # cat with syntax highlighting
brew "fd"            # fast find replacement
brew "ripgrep"       # fast grep replacement
brew "fzf"           # fuzzy finder
brew "delta"         # better git diff
brew "sd"            # modern sed replacement
brew "dust"          # modern du
brew "bottom"        # modern top/htop

# Development tools
brew "neovim"
brew "tmux"
brew "gitmux"        # Git info for tmux status bar
brew "lazygit"       # Git TUI (for nvim integration)
brew "gh"            # GitHub CLI
brew "jq"            # JSON processor
brew "yq"            # YAML processor
brew "httpie"        # modern curl for APIs

# macOS utilities
brew "macism"        # IME switcher for nvim (한영 전환)

# Language tools
brew "pyenv"
brew "pyenv-virtualenv"
brew "node"          # Base Node.js (nvm also installed via install.sh)
# brew "rustup"      # Uncomment if you use Rust
# brew "go"          # Uncomment if you use Go

# Container tools
# brew "docker"        # Skip if Docker Desktop installed
# brew "docker-compose" # Docker Desktop includes this
# brew "colima"        # Alternative to Docker Desktop (conflicts if both installed)

# Optional productivity tools
# brew "starship"    # Cross-shell prompt (already using p10k)
brew "zoxide"        # Smart cd command
brew "direnv"        # Per-project environment variables
brew "watchman"      # File watching service
brew "tree"          # Directory tree viewer

# macOS specific
cask "alacritty"                 # Modern GPU-accelerated terminal
cask "font-meslo-lg-nerd-font"   # For p10k theme
cask "font-fira-code-nerd-font"  # For Alacritty (current config)
cask "rectangle"                 # Window management
cask "alt-tab"                   # Better app switcher